#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# Есть значение радиуса круга
radius = 42

# Выведите на консоль значение прощади этого круга с точностю до 4-х знаков после запятой
# подсказки:
#       формулу можно подсмотреть в интернете,
#       пи возьмите равным 3.1415926
#       точность указывается в функции round()
# TODO здесь ваш код
pi = 3.1415926
s = pi * radius ** 2
print(round(s, 4))


# Далее, пусть есть координаты точки
point = (23, 34)
# где 23 - координата х, 34 - координата у

# Если точка point лежит внутри того самого круга (radius = 42), то выведите на консоль True,
# Или False, если точка лежит вовне круга.
# подсказки:
#       нужно определить расстояние от этой точки до начала координат (0, 0)
#       формула так же есть в интернете >>>>>>>>>>>>>>>>>R 2 = (x- a ) 2 + (y- b ) 2
#       квадратный корень - это возведение в степень 0.5
#       операции сравнения дают булевы константы True и False
# TODO здесь ваш код
x = 23
y = 34
if radius ** 2 >= x ** 2 + y ** 2:
    rezult =True
else:
    rezult = False
print(rezult)


# Аналогично для другой точки
point_2 = (30, 30)
# Если точка point_2 лежит внутри круга (radius = 42), то выведите на консоль True,
# Или False, если точка лежит вовне круга.
# TODO здесь ваш код
x = 30
y = 30
if radius ** 2 >= x ** 2 + y ** 2:
    rezult =True
else:
    rezult = False
print(rezult)

# Пример вывода на консоль:
#
# 77777.7777
# False
# False


