# -*- coding: utf-8 -*-

# Вывести на консоль жителей комнат (модули room_1 и room_2)
# Формат: В комнате room_1 живут: ...

# TODO здесь ваш код
import room_1, room_2

print('В комнате room_1 живут: ', ",".join(room_1.folks), '.', 'В комнате room_2 живёт: ', ",".join(room_2.folks))

# z =room_1.folks
# print(z)
# print(','.join(room_1.folks))

# vowels = ["a", "e", "i", "o", "u"]
# vowels_str = ",".join(vowels)
# print("Строка гласных:", vowels_str)


